Если вернулся раньше: ты вчера хорошо провел время и тебя даже похвалили на паре! Молодец! А пока можно ехать домой отдыхать!
Кнопка: еду домой(+10)
Там где один вариант : 
Ура! Начался новый день! Последние пару дней ты был на раслабоне. Теперь тебе нужно собраться и поехать на лекцию или можно ещё отдохнуть ? 
Кнопка: поехать на лекцию (+10)
Кнопка: никуда не ехать(-10)
8)Там где один вариант : 
Ура! Начался новый день! Последние пару дней ты был на раслабоне. Теперь тебе нужно собраться и поехать на лекцию или можно ещё отдохнуть ? 
Кнопка: поехать на лекцию (+10)
Кнопка: никуда не ехать(-10)
Если поехал на лекцию: 
Приближается сессия и преподаватель выставляет допуски к экзамену. Сумма твоих баллов: (сумма), (если меньше 25, то не допущен ) 
Если меньше: о нет! Ты не допущен к экзу! Придется заново делать лабы и ргз, а пока что 
GAME OVER 
Если больше 25: 
Ура, тебя допустили к экзамену! Он уже совсем скоро,будешь готовиться?
Кнопка: нет, я и так все знаю (-10)
Кнопка: конечно !(+10)
Если не поехал на лекцию: 
Одногруппники в беседе написали, что приближается сессия и преподаватель выставляет допуски к экзамену. Сумма твоих баллов: (сумма), (если меньше 25, то не допущен ) 
Если меньше: о нет! Ты не допущен к экзу! Придется заново делать лабы и ргз, а пока что 
GAME OVER 
Если больше 25: 
Ура, тебя допустили к экзамену! Он уже совсем скоро,будешь готовиться?
Кнопка: нет, я и так все знаю (-10)
Кнопка: конечно !(+10)
9) Если поехал на лекцию: 
Приближается сессия и преподаватель выставляет допуски к экзамену. Сумма твоих баллов: (сумма), (если меньше 25, то не допущен ) 
Если меньше: о нет! Ты не допущен к экзу! Придется заново делать лабы и ргз, а пока что 
GAME OVER 
Если больше 25: 
Ура, тебя допустили к экзамену! Он уже совсем скоро,будешь готовиться?
Кнопка: нет, я и так все знаю (-10)
Кнопка: конечно !(+10)
Если не поехал на лекцию: 
Одногруппники в беседе написали, что приближается сессия и преподаватель выставляет допуски к экзамену. Сумма твоих баллов: (сумма), (если меньше 25, то не допущен ) 
Если меньше: о нет! Ты не допущен к экзу! Придется заново делать лабы и ргз, а пока что 
GAME OVER 
Если больше 25: 
Ура, тебя допустили к экзамену! Он уже совсем скоро,будешь готовиться?
Кнопка: нет, я и так все знаю (-10)
Кнопка: конечно !(+10)
Если не готовился: 
Ты пришел на экзамен и тебе выпал очень сложный билет , в котором ты ничего не знаешь. Что будешь делать? 
Кнопка: пойду на пересдачу (-10)
Кнопка: попытаюсь списать (+5)
Кнопка: напрягу чертоги разума и все вспомню (+10)
Если готовился : поздравляем! Ты пришел на экзамен и тебе выпал очень лёгкий билет, который ты полностью знаешь 
Кнопка: напишу, и все отвечу (+10)
10) Если не готовился: 
Ты пришел на экзамен и тебе выпал очень сложный билет , в котором ты ничего не знаешь. Что будешь делать? 
Кнопка: пойду на пересдачу (-10)
Кнопка: попытаюсь списать (+5)
Кнопка: напрягу чертоги разума и все вспомню (+10)
Если готовился : поздравляем! Ты пришел на экзамен и тебе выпал очень лёгкий билет, который ты полностью знаешь 
Кнопка: напишу, и все отвечу (+10)
В итоге: выводится сумма баллов за все 
Если меньше 50 - не сдал 
Если от 50-70 сдал на 3
Если от 70-90 сдал на 4
Если от 90-100 сдал на 5
